# ConnectorManager Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectorManager Members
ConnectorManager Class Methods Properties See Also
---
The ConnectorManager type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ConnectorManager |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Lookup | Lookup the connector using the unique index value that identify this connector. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Connectors | Return all the Connectors of the Connector Manager. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Owner | This property is used to retrieve the owner of the Connector Manager. |
| UnusedConnectors | Return all the unused Connectors of the Connector Manager. |

# See Also
ConnectorManager Class
Autodesk.Revit.DB Namespace